{
  "content": null,
  "embeds": [
    {
      "title": "DevSphere Rules",
      "description": "# These rules apply within DevSphere, as well as any platforms connected to DevSphere in any way. Your Server Profile is also subject to moderation if it is in violation of any of the listed rules.\n\n## Rule 1: Respectful Conduct\nAs a member of DevSphere, you are expected to respect your fellow members, as well as DevSphere staff. You are not permitted to conduct yourself in a manner which intentionally disrespects another user for any reason, including comments regarding a users:\n\n- Race\n- Religion\n- Sexuality\n- Gender Identity\n- Age\n\nDiscriminatory comments relating to a users identity is considered **hate-speech**, and will be strictly moderated. \n\nTo ensure DevSphere is a comfortable space for all users, you will **not be permitted** to discuss religious or political topics within DevSphere. If you wish to discuss these topics, please take it to DMs. \n\nThis rule is **non-exhaustive**, and may be subject to change. Please use common sense when participating in DevSphere.\n\n## Rule 2: NSFW Content\nNSFW content is strictly prohibited. We do not permit any content that is deemed to be violent, sexual, or otherwise contains adult content, such as the use of drugs and alcohol. This includes text, images, gifs, or any other content shared within DevSphere. NSFW Content also encompasses content which may be harmful to other users. This includes content which violates **Rule 1**, as well as any content which may cause discomfort to users with medical conditions, such as Epilepsy. \n\n## Rule 3: Spam Content\nYou are not permitted to repetitively share content with the intent to annoy or pester other users. This includes spamming text, images, gifs, and any other content deemed to be spam. You are also prohibited from spam-mentioning a user or role, as well as spamming any services, such as **Ticket Creation**.\n\n## Rule 4: Advertisement\nAdvertising your content is disallowed within DevSphere. You are not permitted to advertise your content VIA text, images, links, videos, or in any other form which is deemed to be an advertisement. You are not allowed to send unsolicited DMs to users in an attempt to advertise to them. \n\n## Rule 5: Voice Chat Conduct\nAll of the previous rules apply to your activity within DevSpere voice-chats. You are not allowed to share audio which violates any of the rules. Additionally, you are not allowed to screen-share content that violates any of the rules. You are also prohibited from displaying content VIA your camera which violates any of the rules. \n\n## Rule 6: Scamming\nScamming is entirely disallowed, and will result in an immediate, unappealable ban. Scamming encompasses both server-related and unrelated scams, phishing links, sale of stolen assets, and any other action which is deemed to be an attempted scam.\n\n## Rule 7: Discord TOS\nAs DevSphere is a **community server**, you are prohibited from breaking TOS in any capacity. Any jokes about violating TOS are disallowed as well. You will be punished severely if you are found to be putting the server in jeopardy. Additionally, DevSphere is strictly a **13+** community. Any users found to be under this age requirement will be banned for the length of time it will take for them to turn 13. This action is unappealable.\n\n### This list of rules is non-exhaustive. \nAny attempts to find loopholes or exceptions are strictly prohibited. These rules are subject to change, and an announcement will be made if any changes are made.\n\n### Moderation actions are final.\nIf a moderator asks that you discontinue doing something, you are to do so. If you are punished for your actions, that decision is final. \n\n### Additional information\n\n- [Discord Terms of Service](https://discord.com/terms)\n- [Discord Community Guidelines](https://discord.com/guidelines)",
      "color": 16737380,
      "author": {
        "name": "DevSphere Administration"
      }
    }
  ],
  "attachments": []
}
